TAL_INT_GIT/Sample Data/BY_WMS/ASN_Confirmation/Input/asn_Confirm_target_soap_input/asn_Confirm_target_soap_input

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:rfc:functions">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ZWM_INVENTORY_RECEIPT_IFD>
         <!--Optional:-->
         <INPUT>
            <!--Zero or more repetitions:-->
            <item>
               <TRANID></TRANID>
               <PRTNUM></PRTNUM>
               <PRT_CLIENT_ID></PRT_CLIENT_ID>
               <LOTNUM></LOTNUM>
               <SUP_LOTNUM></SUP_LOTNUM>
               <INVNUM></INVNUM>
               <SUPNUM></SUPNUM>
               <RCVQTY></RCVQTY>
               <STKUOM></STKUOM>
               <WH_ID></WH_ID>
               <TRNDTE></TRNDTE>
               <MANDTE></MANDTE>
               <EXPIRE_DTE></EXPIRE_DTE>
               <REF3></REF3>
               <REF2></REF2>
            </item>
         </INPUT>
         <!--Optional:-->
         <RETURN>
            <!--Zero or more repetitions:-->
            <item>
               <TYPE></TYPE>
               <ID></ID>
               <NUMBER></NUMBER>
               <MESSAGE></MESSAGE>
               <LOG_NO></LOG_NO>
               <LOG_MSG_NO></LOG_MSG_NO>
               <MESSAGE_V1></MESSAGE_V1>
               <MESSAGE_V2></MESSAGE_V2>
               <MESSAGE_V3></MESSAGE_V3>
               <MESSAGE_V4></MESSAGE_V4>
               <PARAMETER></PARAMETER>
               <ROW></ROW>
               <FIELD></FIELD>
               <SYSTEM></SYSTEM>
            </item>
         </RETURN>
      </urn:ZWM_INVENTORY_RECEIPT_IFD>
   </soapenv:Body>
</soapenv:Envelope>